# frozen_string_literal: true

tap 'benwebber/tunnelblickctl'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

brew 'git'
brew 'graphviz'
brew 'icu4c'
brew 'libsodium'
brew 'openssl'
brew 'readline'
brew 'zlib'

brew 'asdf'
brew 'awscli'
brew 'aws-google-auth'
brew 'chezmoi'
brew 'gh'
brew 'heroku'
brew 'htop'
brew 'kubectl'
brew 'mysql'
brew 'nginx'
brew 'node-build', args: ['HEAD']
brew 'nodenv'
brew 'postgresql'
brew 'ruby-build', args: ['HEAD']
brew 'rbenv'
brew 'sqlite'
brew 'tunnelblickctl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask '1password'
cask '1password-cli'
cask 'docker'
cask 'font-jetbrains-mono'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'tunnelblick'
cask 'visual-studio-code'
