# frozen_string_literal: true

tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'twpayne/taps'

brew 'asdf'
brew 'chezmoi'
brew 'git'
brew 'gh'
brew 'graphviz'
brew 'heroku'
brew 'htop'
brew 'icu4c'
brew 'mysql'
brew 'nginx'
brew 'nodenv'
brew 'node-build', args: ['HEAD']
brew 'openssl'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build', args: ['HEAD']
brew 'readline'
brew 'sqlite'
brew 'thefuck'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask '1password'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'ngrok'
cask 'notion'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tunnelblick'
cask 'visual-studio-code'