# frozen_string_literal: true

tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

brew 'asdf'
brew 'git'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'mysql'
brew 'nginx'
brew 'nodenv'
brew 'openssl'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'sqlite'
brew 'thefuck'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask 'docker'
cask 'firefox'
cask 'font-fira-code'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'spotify'
cask 'tunnelblick'
cask 'visual-studio-code'
cask '1password'
